In [2]:
import pandas as pd

In [3]:
import numpy as np

In [4]:


frame = pd.DataFrame(np.random.standard_normal((4,3)),
                     columns=list("bde"),
                     index=["Utah", "Ohio", "Texas", "Oregon"])

In [5]:
frame

               b         d         e
Utah    1.335120 -0.748343  0.236274
Ohio   -1.258376  1.254557 -0.951775
Texas   0.198269  0.472910  0.206706
Oregon -2.113403  0.563594  0.615774

In [6]:
np.abs(frame)

               b         d         e
Utah    1.335120  0.748343  0.236274
Ohio    1.258376  1.254557  0.951775
Texas   0.198269  0.472910  0.206706
Oregon  2.113403  0.563594  0.615774

In [7]:
def f1(x):
    return x.max() - x.min()

In [8]:
frame.apply(f1)

b    3.448523
d    2.002901
e    1.567549
dtype: float64

In [9]:
frame.apply(f1)

b    3.448523
d    2.002901
e    1.567549
dtype: float64

In [10]:
frame.apply(f1, axis="columns")

Utah      2.083463
Ohio      2.512934
Texas     0.274641
Oregon    2.729177
dtype: float64

In [11]:
def f2(x):
    return pd.Series([x.min(), x.max()], index=["min", "max"])

In [13]:
frame.apply(f2)

            b         d         e
min -2.113403 -0.748343 -0.951775
max  1.335120  1.254557  0.615774

In [14]:
def my_fotmat(x):
    return f"{x:.2f}"

In [20]:
frame.map(my_fotmat)

            b      d      e
Utah     1.34  -0.75   0.24
Ohio    -1.26   1.25  -0.95
Texas    0.20   0.47   0.21
Oregon  -2.11   0.56   0.62

In [21]:
frame["e"].map(my_fotmat)

Utah       0.24
Ohio      -0.95
Texas      0.21
Oregon     0.62
Name: e, dtype: object

In [22]:
obj = pd.Series(np.arange(4), index=["d", "a", "b", "c"])

In [23]:
obj

d    0
a    1
b    2
c    3
dtype: int64

In [24]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [25]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=["three", "one"],
                     columns=["d", "a", "b", "c"])

In [26]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [27]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [28]:
frame.sort_index(axis="columns", ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [29]:
obj = pd.Series([4, 7, -3, 3])

In [30]:
obj.sort_values()

2   -3
3    3
0    4
1    7
dtype: int64

In [32]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])

In [34]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [36]:
obj.sort_values(na_position="first")

1    NaN
3    NaN
4   -3.0
5    2.0
0    4.0
2    7.0
dtype: float64

In [37]:
frame = pd.DataFrame({"b": [4, 7, -3, 2], "a": [0, 1, 0, 1]})

In [38]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [39]:
frame.sort_values("b")

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [40]:
frame.sort_values(["a", "b"])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [41]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])

In [42]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [43]:
obj.rank(method="first")

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [44]:
obj.rank(ascending=False)

0    1.5
1    7.0
2    1.5
3    3.5
4    5.0
5    6.0
6    3.5
dtype: float64

In [45]:
frame = pd.DataFrame({"b": [4.3, 7, -3, 2], "a": [0, 1, 0, 1],
                      "c": [-2, 5, 8, -2.5]})

In [46]:
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [47]:
frame.rank(axis="columns")

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [48]:
obj = pd.Series(np.arange(5), index=["a", "a", "b", "b", "c"])

In [49]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [50]:
obj.index.is_unique

False

In [51]:
obj["a"]

a    0
a    1
dtype: int64

In [52]:
obj["c"]

np.int64(4)

In [55]:
df = pd.DataFrame(np.random.standard_normal((5, 3)),
                  index=["a", "a", "b", "b", "c"])

In [56]:
df

          0         1         2
a  0.909539 -0.238005  1.415958
a  0.359716  0.181136  0.933226
b -1.564871 -0.083546  1.118934
b  2.288418 -0.319297 -0.937428
c -1.137915 -0.902392  0.212446

In [57]:
df.loc["b"]

          0         1         2
b -1.564871 -0.083546  1.118934
b  2.288418 -0.319297 -0.937428

In [58]:
df.loc["c"]

0   -1.137915
1   -0.902392
2    0.212446
Name: c, dtype: float64